nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/ecat_examples/servo_motor/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWM:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: D7, peripheral: PWM4, signal: 'A, 0', pin_signal: GPIO_EMC_B1_12}
  - {pin_num: E3, peripheral: PWM4, signal: 'B, 0', pin_signal: GPIO_EMC_B1_13}
  - {pin_num: E5, peripheral: PWM4, signal: 'A, 1', pin_signal: GPIO_EMC_B1_14}
  - {pin_num: E2, peripheral: PWM4, signal: 'B, 1', pin_signal: GPIO_EMC_B1_15}
  - {pin_num: C2, peripheral: PWM4, signal: 'A, 2', pin_signal: GPIO_EMC_B1_17}
  - {pin_num: G1, peripheral: PWM4, signal: 'B, 2', pin_signal: GPIO_EMC_B1_16}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_FLEXPWM4_PWMA00,  /* GPIO_EMC_B1_12 is configured as FLEXPWM4_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_FLEXPWM4_PWMB00,  /* GPIO_EMC_B1_13 is configured as FLEXPWM4_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_14_FLEXPWM4_PWMA01,  /* GPIO_EMC_B1_14 is configured as FLEXPWM4_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_15_FLEXPWM4_PWMB01,  /* GPIO_EMC_B1_15 is configured as FLEXPWM4_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_16_FLEXPWM4_PWMB02,  /* GPIO_EMC_B1_16 is configured as FLEXPWM4_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_17_FLEXPWM4_PWMA02,  /* GPIO_EMC_B1_17 is configured as FLEXPWM4_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: G3, peripheral: EQDC1, signal: 'PHASE, A', pin_signal: GPIO_EMC_B1_00}
  - {pin_num: H4, peripheral: EQDC1, signal: 'PHASE, B', pin_signal: GPIO_EMC_B1_01, identifier: ENC_B}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 = ((BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 &
    (~(BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5_MASK))) /* Mask bits to zero which are setting */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4(0x00U) /* IOMUXC XBAR_INOUT4 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5(0x00U) /* IOMUXC XBAR_INOUT5 function direction select: XBAR_INOUT as input */
    );
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_XBAR1_XBAR_INOUT04,  /* GPIO_EMC_B1_00 is configured as XBAR1_XBAR_INOUT04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_XBAR1_XBAR_INOUT05,  /* GPIO_EMC_B1_01 is configured as XBAR1_XBAR_INOUT05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout04, kXBAR1_OutputEqdc1Phasea); /* IOMUX_XBAR_INOUT04 output assigned to XBAR1_IN4 input is connected to XBAR1_OUT87 output assigned to EQDC1_PHASEA */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout05, kXBAR1_OutputEqdc1Phaseb); /* IOMUX_XBAR_INOUT05 output assigned to XBAR1_IN5 input is connected to XBAR1_OUT88 output assigned to EQDC1_PHASEB */
}

void BOARD_Port0_MII_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_00_ECAT_RX_CLK_0, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_01_ECAT_RX_DATA2_0, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_02_ECAT_RX_DATA3_0, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_03_ECAT_TX_DATA2_0, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_04_ECAT_TX_DATA3_0, 1);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_05_ECAT_TX_DATA0_0, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_06_ECAT_TX_DATA1_0, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_07_ECAT_TX_EN_0, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_08_ECAT_TX_CLK_0, 1);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_09_ECAT_RX_DATA0_0, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_10_ECAT_RX_DATA1_0, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_11_ECAT_RX_DV_0, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_12_ECAT_PT0_RX_ER, 0);
  
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_16_ECAT_LINK_0,          /* GPIO_AD_16 is configured as ECAT_LINK_0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */

  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_16_ECAT_LINK_0,          /* GPIO_AD_16 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
}

void BOARD_Port1_MII_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_30_ECAT_RX_DATA0_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_31_ECAT_RX_DATA1_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_34_ECAT_RX_DATA2_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_35_ECAT_RX_DATA3_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_33_ECAT_RX_ER_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_32_ECAT_RX_DV_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_38_ECAT_RX_CLK_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_27_ECAT_TX_DATA0_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_26_ECAT_TX_DATA1_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_37_ECAT_TX_DATA2_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_36_ECAT_TX_DATA3_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_28_ECAT_TX_EN_1, 0);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_29_ECAT_TX_CLK_1, 1);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_17_ECAT_LINK_1,          /* GPIO_AD_17 is configured as ECAT_LINK_1 */
      0U); 
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_17_ECAT_LINK_1,          /* GPIO_AD_17 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
}

